{"meta":{"title":"Locke's Note","subtitle":"Learning Notes","description":"InfoVis","author":"Zihan Teng","url":"http://example.com","root":"/"},"pages":[{"title":"tags","date":"2023-02-07T06:40:37.000Z","updated":"2023-02-14T09:39:15.665Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Leetcode 1","slug":"Leetcode-1","date":"2023-03-25T12:58:44.000Z","updated":"2023-03-25T13:08:04.628Z","comments":true,"path":"2023/03/25/Leetcode-1/","link":"","permalink":"http://example.com/2023/03/25/Leetcode-1/","excerpt":"","text":"Sum of two numbers12345678910var twoSum = function(nums, target) &#123; const map = new Map(); for(let i = 0, len = nums.length;i &lt; len;i++) &#123; if(map.has(target - nums[i])) &#123; return [map.get(target - nums[i]), i]; &#125; map.set(nums[i], i); &#125; return [];&#125;; 通过HashMap，在循环的时候进行查找我们将HashMap的Key定位nums[i]，Value定义为i。那么，每次循环到一个数的时候，我们就可以在HashMap中查找是否存在key &#x3D;&#x3D;&#x3D; target - nums[i]，如果存在则可以直接返回对应的两个下标，否则，将当前的值记入到HashMap中。时间复杂度：O(n)空间复杂度：O(n)","categories":[],"tags":[{"name":"Leetcode","slug":"Leetcode","permalink":"http://example.com/tags/Leetcode/"}]},{"title":"Multidimensional Multivariant Data","slug":"Multidimensional-Multivariant-Data","date":"2023-03-05T09:28:58.000Z","updated":"2023-03-25T13:07:51.355Z","comments":true,"path":"2023/03/05/Multidimensional-Multivariant-Data/","link":"","permalink":"http://example.com/2023/03/05/Multidimensional-Multivariant-Data/","excerpt":"","text":"高维多元数据 高维多元数据是指每个数据对象有两个及以上独立(高维)或相关属性（多元）的数据 常规二维三维数据可以采用常规可视化方法表示:散点图（Scatter Plot），当超过三维时可可以使用视觉编码（颜色，大小，形状）表示额外属性，但这种方法不适合更高维度数据（视觉编码有限，会降低可视化的可读性） 三类方法 空间映射 图标法 基于像素可视化方法 空间映射法散点图矩阵对于N维数据，采用$N^2$个散点图逐一表示N个属性之间的两两关系，组成$N*N$,位于对角线上的属性可用于揭示数据在特定属性上的分布","categories":[],"tags":[{"name":"InfoVis","slug":"InfoVis","permalink":"http://example.com/tags/InfoVis/"}]},{"title":"Summary on soccer visual analytics system","slug":"Soccer-Analytics-System","date":"2023-02-22T08:24:37.000Z","updated":"2023-03-02T02:52:03.690Z","comments":true,"path":"2023/02/22/Soccer-Analytics-System/","link":"","permalink":"http://example.com/2023/02/22/Soccer-Analytics-System/","excerpt":"Team formation changes are a common high-level strategy in football and are crucial for gamesresult. Due to the highly spatial and temporal nature of formation changes, it is difficult for professional analysts to identify and detect patterns in team formation changes. Existing work has focused on match results and statistics, but has neglected the process of temporal and spatial changes in formations and individual behaviour. These two papers both propose new visual analysis systems (HeatVIS, Forvizor) to help analysts interactively explore the temporal and spatial variation of player and team formations and related contextual information in a comprehensive manner.","text":"Team formation changes are a common high-level strategy in football and are crucial for gamesresult. Due to the highly spatial and temporal nature of formation changes, it is difficult for professional analysts to identify and detect patterns in team formation changes. Existing work has focused on match results and statistics, but has neglected the process of temporal and spatial changes in formations and individual behaviour. These two papers both propose new visual analysis systems (HeatVIS, Forvizor) to help analysts interactively explore the temporal and spatial variation of player and team formations and related contextual information in a comprehensive manner. HeatVIS uses data directly from tournament officials and detects formations using the K-Means algorithm, while ForVizor proposes a data processing pipeline to capture data from football games and process it systematically. The process of this pipeline is: (1) collecting video (2) propose a semi- automatic interactive tracking method to track player (3) map positions to 2D planes(4) detect formations. Through interviews and surveys with coaches and analysts, the researchers identified the design objectives. Both systems were designed to show the spatial and temporal variation of team formations, with HeatVIS focusing on the spatial and temporal variation of player attributes (speed, location), while ForVizor was more intuitive in showing the spatial variation of team formations and the correspondence between the two team formations. HeatVIS proposes a Player Attribute Heatmap (PAH) based on heat map to show the spatio-temporal variation of players’ position and speed, and PAH is used to show the situation of the game and the tendency of teams to play in the left and right halves of the field by means of different axis ordering. The researchers also design the Tactic Scheme Heatmap (TAS) to show the evolution of the formations. the first representation of the TAS is a qualitative colour map that associates each strategy scheme with a colour. The second representation will have three columns of Defence-Middle-Attack and a colour mapping of the number of people, indicating the formation composition. Forvizor’s formation view provides comprehensive spatio- temporal information on the changes in team formation. The display view presents detailed positional information about the team and individual statistics. In the formation view, a descriptive timeline is first used to mark significant events using glyphs, and a confrontation matrix is used to represent formation pairs. A change in formation can actually be represented as a movement of people in different parts of the team.ForVizor researchers have designed Formation Flow, based on the Sankey diagram, which elaborates on the temporal and spatial changes in the team formation and shows the movement and substitution of players, the position of the football and other key factors. Formation flow not only shows the composition of the formation as well as TAS (HeatVIS), but also focuses more on the process of special change. Both ForVizor and HeatVIS have interfaces to display player information (Rader Chart, Heatmap), but ForVizor allows more dimensions to be viewed and provides an interactive view to reduce the cognitive load. In addition, ForVizor allows analysts to analyse team performance data.In the user evaluation phase, the analysts use the system to assess usability. Most user’s feedbacks were very positive and the user also recommended reduce the amount of information and highlighting typical team formations.[1]V. Machado, R. Leite, F. Moura, S. Cunha, F. Sadlo, “Visual soccer match analysis using spatiotemporal positions of players,” Computers &amp; graphics, vol. 68, pp. 84–95, 2017, (HeatVIS) [2]Y. Wu et al., “ForVizor: Visualizing Spatio-Temporal Team Formations in Soccer,” IEEE transactions on visualization and computer graphics, vol. 25, no. 1, pp. 65–75","categories":[],"tags":[{"name":"Reflections","slug":"Reflections","permalink":"http://example.com/tags/Reflections/"}]},{"title":"Time-varying Vis","slug":"Time-varying-Vis","date":"2023-02-14T09:19:48.000Z","updated":"2023-02-14T09:21:38.597Z","comments":true,"path":"2023/02/14/Time-varying-Vis/","link":"","permalink":"http://example.com/2023/02/14/Time-varying-Vis/","excerpt":"","text":"时变数据","categories":[],"tags":[{"name":"InfoVis","slug":"InfoVis","permalink":"http://example.com/tags/InfoVis/"}]},{"title":"Visuallization Chart","slug":"Visuallization-Chart","date":"2023-02-09T10:25:33.000Z","updated":"2023-02-13T09:26:39.933Z","comments":true,"path":"2023/02/09/Visuallization-Chart/","link":"","permalink":"http://example.com/2023/02/09/Visuallization-Chart/","excerpt":"可视化图表数据可视化三要素 数据表示与转换 数据的可视化呈现 用户交互 可视化数据 类别型数据:用于区分物体 有序型数据:用来表示对象间的顺序关系 比值型数据:用于比较数值间的比例关系，基于真正0点(一般不与区间型数据区分) 区间型数据:用于对象间的比较复杂数据通常是这4种数据的组合&#x2F;变异","text":"可视化图表数据可视化三要素 数据表示与转换 数据的可视化呈现 用户交互 可视化数据 类别型数据:用于区分物体 有序型数据:用来表示对象间的顺序关系 比值型数据:用于比较数值间的比例关系，基于真正0点(一般不与区间型数据区分) 区间型数据:用于对象间的比较复杂数据通常是这4种数据的组合&#x2F;变异 原始数据绘图 数据轨迹:一种标准的单变量数据呈现方法，较好的呈现数据分布、离群值和均值的偏移 柱状图(Bar Chart):柱状图每根直柱内部也可用像素图(Pixel Chart)编码，称为堆叠图(Stacked Graph) 直方图(Histogram):对数据集某个数据属性频率统计，展现数据的分布、离群值。直方图各个部分之和等于整体，柱状图没有限制，双直方图是一种便于比较两个数据集的方法 饼图(Pie Chart):分块方式(环状方式)是环状树图等可视表达的基础 等值线图(Contour Map):等值线图使用相等数值的数据点连线来表示数据的连续分布和变化规律 走势图(Sparkline): 走势图以折线图为基础，大小与文本相仿，直接嵌入文本&#x2F;表格中，无法表达太多细节信息（类似无刻度的数据轨迹） 散点图矩阵(Scatter Plot Matrix):散点图矩阵用来展现高维数据属性分布，对不同属性进行两两组合 韦恩图(Venn Diagram):使用封闭图形来表达数据集合间的关系，表示集合间所有逻辑关系，用于集合关系展示 热力图(Heat Map):热力图使用颜色来表达位置相关的数值数据大小，或在地图按位置排列 简单统计值盒须图:用一个长方形盒子表示数据的大致范围，并用横线标明均值位置，并标注最大值和最小值 可视化方法与规则 可视化设计步骤与原则 D-V直观映射：使用合适的视觉通道 视图选择与交互设计 滚动与缩放:解决数据无法在当前分辨率下完整展示 颜色映射：允许用户修改调色盘 数据映射方式的控制 数据缩放和裁剪 考虑信息密度:数据-墨水比(Data-ink ratio)衡量可视化表达效果 提高可视化美学 聚焦:利用前向注意力增加导视性 平衡 简单","categories":[],"tags":[{"name":"InfoVis","slug":"InfoVis","permalink":"http://example.com/tags/InfoVis/"}]},{"title":"Visual Perception","slug":"Visual-Perception","date":"2023-02-07T06:43:05.000Z","updated":"2023-02-09T10:11:23.412Z","comments":true,"path":"2023/02/07/Visual-Perception/","link":"","permalink":"http://example.com/2023/02/07/Visual-Perception/","excerpt":"视觉感知用户通过视觉感知(Visual Perception)器官获得可视信息，编码并形成认知(Cognition)，在交互分析过程中获取解决问题的方法。人眼是一个具有高度并行处理能力的器官，人类视觉具有迄今为止最高的处理带宽，人类视觉对于以数字，文本形式存在的非形象化信息的直接感知能力远远落后于对于形象化视觉符号的理解。","text":"视觉感知用户通过视觉感知(Visual Perception)器官获得可视信息，编码并形成认知(Cognition)，在交互分析过程中获取解决问题的方法。人眼是一个具有高度并行处理能力的器官，人类视觉具有迄今为止最高的处理带宽，人类视觉对于以数字，文本形式存在的非形象化信息的直接感知能力远远落后于对于形象化视觉符号的理解。 视觉感知处理过程感知：客观事物通过感觉器官在人脑中的直接反映认知：对信息获取，编码，储存，提取和使用一系列加工处理过程 大脑对于视觉信息的记忆速度浩宇对语言的记忆效果与记忆速度 视觉可以被分为低阶视觉(物理性质) 与 高阶视觉(识别与分类) 格式塔理论观点：感知事物大于眼睛见到的事物。人在观察时，倾向于将视觉感知内容理解为常规的，简单的，相连的，对称的结构。在获取视觉感知时，会倾向于将事物理解为一个整体而不是组成该事物所有部分的集合 贴近原则（Proximity）:当视觉元素在空间距离上相距较近时，人们倾向将它们归于一组 相似原则（Similarity）:人们会自然的根据事物相似性进行感知分组 连续原则（Continuity）:人们将不连续物体视为连续的整体 闭合原则（Closure）:物体形状足够表示表征物体本身，人们就容易感知整个物体而忽视未闭合的特征 共势原则（Common Fate）:一组物体具有沿着相似光滑路径运动或排列模式，人眼将识别为同一类物体 好图原则（Good Figure）:人眼会将一组物体安简单规则有序的排列方式进行识别 对成性原则（Symmetry）:人的意识倾向于将物体识别为堆成的形状，将数据按照对称性原则分为偶数个对称部分，对称部分会被识别为相连的形状，增强认知的愉悦度 经验原则（Past Experience）:某些情况下视觉感知与过去经历有关（图示理论） 视觉形象首先作为统一的整体被认知，而后才以部分的形式被认知（人先看见一个构图的整体，然后才看见这一构图整体的各个部分） 相关实验 变化盲视 选择注意 遗忘进程 认知偏差 颜色颜色视觉理论: 三色视觉理论与补色过程理论色彩空间：RGB&#x2F;CMYK 后发展HSL 视觉编码视觉假象(Visual Illusion):需要合理的设置上下文环境可视化编码（Visual Encoding）: 标记（图形元素）：数据属性到可视化元素的映射，代表性质分类 控制标记视觉特征的视觉通道：数据的值到标记的视觉表现映射，展现定量信息 常见视觉通道：位置，大小，形状，方向，色调，亮度不同的视觉通道在表达信息的作用和能力存在不同特性视觉通道类型：数据以有序和分类两种形式存在 色调用于表现分类而无序的数据，同一颜色不同亮度表现顺序性视觉通道表现力: 指的是表达数据的完整性根据表现力和有效性对视觉通道排序定性视觉通道: 形状，颜色色调，空间位置定量视觉通道: 长度，面积，体积，斜度 etc分组视觉通道: 接近性（basic），显示连接，显示包围] 表现力的判断标准精确性: 史蒂文斯幂次法则$S&#x3D;I^n$(S为大脑感知结果，I表示刺激值，n范围从0.5-3.5) 亮度是次线性信号(0.5)，电流是超线性信号(3.5)，长度是线性信号(1.0) 可辨识性可分离性: 视觉通道会两两干扰，圆的大小过小时候会影响人对色彩的感知视觉突出: 人们依靠前注意力(Preattentive)发现特殊物体小号的时间不受背景对象数量影响，不同视觉对象的视觉突出表现力不同(color&gt;shape) 颜色亮度: 亮度适合编码有序的数据，尽量使用少于6个不同的可辨亮度层次。亮度边界效应明显，感知缺乏精确性饱和度: 饱和度与尺寸直径存在非常强烈相互影响，小尺寸上饱和度识别非常困难，边界效应明显，缺乏精确性色调: 色调比亮度与饱和度拥有更多可区分层次，色调也与其他视觉通道存在相互影响，在不连续区域中难以被准确区分配色系统:colorBrewer，Kuler，cartocolors 尺寸长度是一维的尺寸，面积是二维的尺寸，体积则是三维的尺寸。人们对一维尺寸的判断是线性的，对多维尺寸的判断随着维度升高而变的越来越不准确 斜度和角度斜度和角度用于编码分类或有序的属性。相邻两个象限中间斜度所指方向呈现中性特征，可以编码数据的发散性(Divergence) 纹理纹理被认为是多种视觉变量的组合，包括形状、颜色与方向。应用纹理可以避免在可视化设计中使用过多色彩（Texture.js） 视觉多通（Visual Multiplexing）可正确解码的多可视化信息的堆叠方式，有12类组合方式没看懂，以后看: Visual multiplexing.Computer Graphics Forum","categories":[],"tags":[{"name":"InfoVis","slug":"InfoVis","permalink":"http://example.com/tags/InfoVis/"}]},{"title":"Introduction to Data Visualization","slug":"Introduction-to-data-visualization","date":"2023-02-01T06:29:15.000Z","updated":"2023-02-07T06:30:57.446Z","comments":true,"path":"2023/02/01/Introduction-to-data-visualization/","link":"","permalink":"http://example.com/2023/02/01/Introduction-to-data-visualization/","excerpt":"可视化分类 Scientific Visualization 标量场可视化 将数值映射为颜色或透明度 等值线法-抽取链接f(x,y,z)&#x3D;c的点集连接成线(二维)或面(三维) 直接体绘制法 向量场(流场)可视化 粒子对流法 将向量场转换为一帧或多帧纹理图像 图标编码耽搁或简化后的向量信息 张量场可视化","text":"可视化分类 Scientific Visualization 标量场可视化 将数值映射为颜色或透明度 等值线法-抽取链接f(x,y,z)&#x3D;c的点集连接成线(二维)或面(三维) 直接体绘制法 向量场(流场)可视化 粒子对流法 将向量场转换为一帧或多帧纹理图像 图标编码耽搁或简化后的向量信息 张量场可视化 Information Visualization处理抽象的，非结构化数据集合(Text,Diagram,Structure,Map) 时空数据可视化 地理信息：合理选择布局可视化元素 时变数据：线性与周期性特征 层次与网络结构可视化 层次与图数据可视化：点线图（合理有效布局节点） 文本和跨媒体数据可视化 从非结构化文本数据中提取结构化信息并可视化 多变量数据可视化 将数据降维到低维空间并通过相互冠霖的多视图表现 Visual Analytics 以可视交互界面为基础的分析推理科学 当前数据分析方法大多基于先验模型 以视觉感知为通道，通过可视交互界面，融合人脑智能与机器智能 在分析可视化系统时，设计者需要考虑三个不同方面的约束：计算能力，感知和认知能力以及显示能力","categories":[],"tags":[{"name":"InfoVis","slug":"InfoVis","permalink":"http://example.com/tags/InfoVis/"}]}],"categories":[],"tags":[{"name":"Leetcode","slug":"Leetcode","permalink":"http://example.com/tags/Leetcode/"},{"name":"InfoVis","slug":"InfoVis","permalink":"http://example.com/tags/InfoVis/"},{"name":"Reflections","slug":"Reflections","permalink":"http://example.com/tags/Reflections/"}]}